#[test]

/*
/* Make it work by reordering some code */
fn main() {
    let mut data = 10;
    let ref1 = &mut data;
    let ref2 = &mut *ref1;

    *ref1 += 1;
    *ref2 += 2;

    println!("{}", data);
}
*/

fn main() {
    let mut data = 10;

    {
        let ref1 = &mut data;
        *ref1 += 1;
    } // `ref1` завершує своє життя тут

    {
        let ref2 = &mut data;
        *ref2 += 2;
    } // `ref2` завершує своє життя тут

    println!("{}", data); // Очікуваний результат: 13
}


/*
Розділення на окремі блоки:
ref1 і ref2 тепер розташовані в окремих блоках { }. Це дозволяє посиланню ref1 завершити своє
існування перед створенням ref2. Коли блок { } завершується, ref1 і ref2 виходять з області видимості,
дозволяючи створити нове змінне посилання на data.

Покрокове оновлення data:
Спочатку через ref1 збільшуємо data на 1. Після того, як ref1 виходить з області видимості, використовуємо нове посилання ref2, щоб збільшити data ще на 2.
*/